Tekla Open API Reference for Tekla Structures 2025
SymbolElement Constructor (SymbolInfo)
 Creates a new symbol element instance with the given symbol.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SymbolElement(
	SymbolInfo Symbol
)
Public Sub New (
	Symbol As SymbolInfo
)
Parameters
Symbol
Type: Tekla.Structures.Drawing.SymbolInfo
The symbol to be used.
See Also
Reference
SymbolElement Class
SymbolElement Overload
Tekla.Structures.Drawing Namespace